Descriptive Statistics - Measures of Central Tendency and variability
1)Provide summary statistics (mean, median, minimum, maximum, standard deviation) for a dataset (age, income etc.) with numeric variables grouped by one of the qualitative (categorical) variable. For example, if your categorical variable is age groups and quantitative variable is income, then provide summary statistics of income grouped by the age groups. Create a list that contains a numeric value for each response to the categorical variable.
2)Write a Python program to display some basic statistical details like percentile, mean, standard deviation etc. of the species of ‘Iris-setosa’, ‘Iris-versicolor’ and ‘Iris- versicolor’ of iris.csv dataset.

In [44]:
import pandas as pd
import numpy as np
import seaborn as sns

In [45]:
df1=pd.read_csv("nba.csv")

In [46]:
df1

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [47]:
df1.describe()

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [48]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [49]:
df1.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [50]:
df1.size

4122

In [51]:
df1.shape

(458, 9)

In [52]:
df1.isnull().sum()

Name         1
Team         1
Number       1
Position     1
Age          1
Height       1
Weight       1
College     85
Salary      12
dtype: int64

In [53]:
df1.replace("?",np.nan,inplace=True)

In [54]:
df1["Number"].fillna(df1["Number"].median(),inplace=True)
df1["Age"].fillna(df1["Age"].median(),inplace=True)
df1["Weight"].fillna(df1["Weight"].median(),inplace=True)
df1["Salary"].fillna(df1["Salary"].median(),inplace=True)
df1.fillna("Not Available",inplace=True)

In [55]:
df1.isnull().sum()

Name        0
Team        0
Number      0
Position    0
Age         0
Height      0
Weight      0
College     0
Salary      0
dtype: int64

In [56]:
df1.mean(numeric_only=True)

Number    1.766812e+01
Age       2.693668e+01
Weight    2.215197e+02
Salary    4.790188e+06
dtype: float64

In [57]:
df1.median(numeric_only=True)

Number         13.0
Age            26.0
Weight        220.0
Salary    2839073.0
dtype: float64

In [58]:
df1.std(numeric_only=True)

Number    1.595011e+01
Age       4.399414e+00
Weight    2.633957e+01
Salary    5.170063e+06
dtype: float64

In [59]:
df1.min(numeric_only=True)

Number        0.0
Age          19.0
Weight      161.0
Salary    30888.0
dtype: float64

In [60]:
df1.max(numeric_only=True)

Number          99.0
Age             40.0
Weight         307.0
Salary    25000000.0
dtype: float64

In [61]:
df1.count(numeric_only=True)

Number    458
Age       458
Weight    458
Salary    458
dtype: int64

In [62]:
df1.mode().loc[0]

Name                Aaron Brooks
Team        New Orleans Pelicans
Number                       5.0
Position                      SG
Age                         24.0
Height                       6-9
Weight                     220.0
College            Not Available
Salary                  947276.0
Name: 0, dtype: object

In [63]:
bins=[15,20,25,30,35,40,45]
labels=["15-19","20-24","25-29","30-34","35-39","40-44"]
df1["Age Group"]=pd.cut(df1["Age"],bins=bins,labels=labels,include_lowest=True,right=False)
df1

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Age Group
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,25-29
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,25-29
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,2839073.0,25-29
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,20-24
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,Not Available,5000000.0,25-29
...,...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0,25-29
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,Not Available,900000.0,20-24
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,Not Available,2900000.0,25-29
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0,25-29
457,Not Available,Not Available,13.0,Not Available,26.0,Not Available,220.0,Not Available,2839073.0,25-29

In [64]:
result=df1.groupby("Age Group").agg({"Salary":["mean","median","max","min","std","count","skew"]})
print(result)

                 Salary                                                        \
                   mean     median         max        min           std count
Age Group
15-19      1.930440e+06  1930440.0   2127840.0  1733040.0  2.791658e+05     2
20-24      2.719916e+06  1686039.5  16407501.0    30888.0  3.165986e+06   152
25-29      5.619659e+06  3403766.5  20158622.0    55722.0  5.490368e+06   182
30-34      7.037296e+06  5209584.5  22970500.0   200600.0  6.124321e+06    90
35-39      3.671810e+06  2839073.0  25000000.0   222888.0  4.587180e+06    29
40-44      4.666917e+06  5250000.0   8500000.0   250750.0  4.155421e+06     3


               skew
Age Group
15-19           NaN
20-24      2.965910
25-29      1.044380
30-34      1.136558
35-39      3.833556
40-44     -0.619002

In [65]:
df2=pd.read_csv("iris.csv")

In [66]:
df2

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [67]:
df2.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [68]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [69]:
df2.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [70]:
df2.shape

(150, 5)

In [71]:
df2.size

750

In [72]:
df2.ndim

2

In [73]:
df2.isnull().sum()

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [74]:
df2[(df2["species"]=="setosa")].describe()

       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000     50.00000
mean        5.00600     3.418000      1.464000      0.24400
std         0.35249     0.381024      0.173511      0.10721
min         4.30000     2.300000      1.000000      0.10000
25%         4.80000     3.125000      1.400000      0.20000
50%         5.00000     3.400000      1.500000      0.20000
75%         5.20000     3.675000      1.575000      0.30000
max         5.80000     4.400000      1.900000      0.60000

In [75]:
df2[(df2["species"]=="versicolor")].describe()

       sepal_length  sepal_width  petal_length  petal_width
count     50.000000    50.000000     50.000000    50.000000
mean       5.936000     2.770000      4.260000     1.326000
std        0.516171     0.313798      0.469911     0.197753
min        4.900000     2.000000      3.000000     1.000000
25%        5.600000     2.525000      4.000000     1.200000
50%        5.900000     2.800000      4.350000     1.300000
75%        6.300000     3.000000      4.600000     1.500000
max        7.000000     3.400000      5.100000     1.800000

In [76]:
df2[(df2["species"]=="virginica")].describe()

       sepal_length  sepal_width  petal_length  petal_width
count      50.00000    50.000000     50.000000     50.00000
mean        6.58800     2.974000      5.552000      2.02600
std         0.63588     0.322497      0.551895      0.27465
min         4.90000     2.200000      4.500000      1.40000
25%         6.22500     2.800000      5.100000      1.80000
50%         6.50000     3.000000      5.550000      2.00000
75%         6.90000     3.175000      5.875000      2.30000
max         7.90000     3.800000      6.900000      2.50000